
Процедура ПриЗаписи(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ЭтотОбъект.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Наименование", Наименование);
	
	Попытка
		
		НачатьТранзакцию();
		Если Метаданные.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый Тогда
			Блокировка.Заблокировать();
		КонецЕсли;

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЦКомпьютеры.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ТЦКомпьютеры КАК ТЦКомпьютеры
		                      |ГДЕ
		                      |	ТЦКомпьютеры.Ссылка <> &Ссылка
		                      |	И ТЦКомпьютеры.Наименование = &Наименование");
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Сообщить(НСтр(СтрШаблон("ru = 'Компьютер с наименованием ""%1"" уже есть в справочнике «Компьютеры»'", Наименование)));
			Отказ = Истина;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
